# RbsFpSprinklerOrificeParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsFpSprinklerOrificeParam Property
ParameterTypeId Class See Also
---
"Orifice"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsFpSprinklerOrificeParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsFpSprinklerOrificeParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsFpSprinklerOrificeParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace